waitless/app/controllers/restaurants_controller.rb

	def index
    @search = (params[:search].length > 0) ? params[:search] : "restaurants"
		parameters = { term: @search, limit:20}
		@location_filter = (params[:location].length > 0) ? params[:location] : "San Francisco"
  	@response = Yelp.client.search(@location_filter, parameters).as_json

    if @response['hash']['total'] != 0
    	@results = []
    	for i in 0..9
    		@business = @response['hash']['businesses'][i]
        @restaurant = Restaurant.where(yelp_id: @business['id']).first
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."yelp_id" = $1  ORDER BY "restaurants"."id" ASC LIMIT 1  [["yelp_id", "coqueta-san-francisco"]]