waitless/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 9]]
---
  def show
    if !current_user
      redirect_to '/'
    end
    @user = User.find(params[:id])