app/controllers/reservations_controller.rb

	def create
		@restaurant = Restaurant.find(params[:restaurant_id])
		@reservation = @restaurant.reservations.new(
			number_in_party: params[:reservation][:number_in_party],
			user_id: session[:user_id],
			restaurant_id: params[:restaurant_id],
			timer: @restaurant.wait_time, name: params[:reservation][:name])

		if @reservation.save
			NotifyUsersWorker.perform_in(@reservation.notification_delay.minutes, @reservation.id)
			@restaurant.update_wait_time
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "reservations" ("number_in_party", "user_id", "restaurant_id", "timers", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["number_in_party", 2], ["user_id", 11], ["restaurant_id", 8], ["timers", 0], ["created_at", "2015-07-20 16:48:58.464920"], ["updated_at", "2015-07-20 16:48:58.464920"]]
UPDATE "reservations" SET "table_ready_time" = '2015-07-21 18:52:46.872105' WHERE "reservations"."id" = $1  [["id", 6]]