app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."yelp_id" = $1  ORDER BY "restaurants"."id" ASC LIMIT 1  [["yelp_id", "el-mercado-urbano-at-la-urbana-san-francisco"]]
---
  def index
    @search = (params[:search].length > 0) ? params[:search] : "restaurants"
    parameters = { term: @search, limit:10}
    location_filter = (params[:location].length > 0) ? params[:location] : "San Francisco"

    @response = Yelp.client.search(location_filter, parameters).as_json

    if @response['hash']['total'] != 0
      @results = []
      for i in 0..9
        @business = @response['hash']['businesses'][i]
        @categories = []
        @business['categories'].each do |category|
          @categories.push(category[0])
        end

        @restaurant = Restaurant.where(yelp_id: @business['id']).first

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 29]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."restaurant_id" = $1  [["restaurant_id", 16]]
---
  def show
    @restaurant = Restaurant.find(params[:id])
    @response = Yelp.client.business(@restaurant.yelp_id).as_json['hash']
    @reservations = @restaurant.reservations.order(:id)