app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 11]]
---
  def show
    if !current_user
      redirect_to '/'
    end

    @user = User.find(params[:id])